КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_МЧД/КонтурЛогистика_МЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_МЧД</name>
  <attributes>
    <name>НомерДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СведСистОтм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>XMLфайлМЧД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПодпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДиадок</name>
    <comment>Доверитель</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружена</name>
    <comment>1 - из диадока, 2 - из файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доверитель_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеПредставители</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ФорматыМЧД</types>
    </type>
  </attributes>
  <attributes>
    <name>Наша</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СовместноеОсуществлениеПолномочий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УтратаПолномочийПриПередоверии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПолномочие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПолномочия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйДоверитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходнойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыданаВПорядкеПередоверия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРодительскойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьОформленияПередоверия</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВозможностиОформленияПередоверияМЧД</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредставителей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представители</name>
    <attributes>
      <name>ТипПредставителя</name>
      <comment>&quot;1&quot; - ЮЛ; &quot;2&quot; - ИП; &quot;3&quot; - ФЛ; &quot;4&quot; - филиал ЮЛ; &quot;5&quot; - филиал иностранного ЮЛ</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПредставителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоверенныеСертификаты</name>
    <attributes>
      <name>КодОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыдан</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Полномочие</name>
      <type>
        <types>EnumRef.КонтурЛогистика_Полномочия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Полномочия</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мнемоника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПолномочия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОграничений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ограничения</name>
    <attributes>
      <name>ИдентификаторПолномочия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовоеЗначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛицаПредставителиЮЛ</name>
    <attributes>
      <name>ИдентификаторПредставителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ФорматыМЧД/КонтурЛогистика_ФорматыМЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ФорматыМЧД</name>
  <enumValues>
    <name>Формат002</name>
  </enumValues>
  <enumValues>
    <name>Формат003</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВариантыПроверкиПолномочийМЧД/КонтурЛогистика_ВариантыПроверкиПолномочийМЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</name>
  <enumValues>
    <name>НеПроверять</name>
  </enumValues>
  <enumValues>
    <name>ПроверятьСПредупреждением</name>
  </enumValues>
  <enumValues>
    <name>ПроверятьСОшибкой</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_МЧД/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	
	ПоказатьПолеПросмотраМЧД();
	
	УстановитьВидимостьОграничений();
			 		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
	УправлениеДовереннымиСертификатами();
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		Элементы.ОткрытьОбщуюНастройкуСпособОтправкиМЧД.Ширина = 23;
		Элементы.ОткрытьОбщуюНастройкуДоставкаМЧДФайлом.Ширина = 24;
		Элементы.НадписьПредупреждение.РастягиватьПоГоризонтали = Истина;		
	КонецЕсли;
					
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикаСобытийЭлементовФормы

&НаКлиенте
Процедура ПредставителиПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.Представители.ТекущиеДанные;
	
	Если Текданные = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	Элементы.ФизическиеЛицаПредставителиЮЛ.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторПредставителя", ТекДанные.ИдентификаторПредставителя);								
	
КонецПроцедуры

&НаКлиенте
Процедура ПолномочияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Полномочия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ПолномочияОграничения" Тогда
	    				
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторПолномочия", ТекущиеДанные.ИдентификаторПолномочия);
		Элементы.Ограничения.ОтборСтрок = ОтборСтрок;
		
		Элементы.Ограничения.Видимость = Не Элементы.Ограничения.Видимость;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолномочияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Полномочия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Ограничения.Видимость И ТекущиеДанные.КоличествоОграничений > 0 Тогда
	    				
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторПолномочия", ТекущиеДанные.ИдентификаторПолномочия);
		Элементы.Ограничения.ОтборСтрок = ОтборСтрок;
		
	Иначе 
		
		Элементы.Ограничения.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСФайламиПодключено", ЭтаФорма);	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаNaloggovru(Команда)
	
	АдресПроверки = "https://m4d.nalog.gov.ru/EMCHD/get-info?guid=" + Объект.ИдентификаторДоверенности
		+ "&innP=" + КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ОрганизацияДиадок, "ИНН")
		+ "&innR=" + ?(Объект.Представители.Количество() > 0, Объект.Представители[0].ИНН, "");
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		ЗапуститьПриложение(АдресПроверки);
	Иначе
		ПерейтиПоНавигационнойСсылке(АдресПроверки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИгнорируемыеОшибки(Команда)
	
	Если Элементы.ДоверенныеСертификаты.Видимость Тогда
		Элементы.ДоверенныеСертификаты.Видимость = Ложь;
		Элементы.ПоказатьИгнорируемыеОшибки.Заголовок = "Игнорируемые ошибки";		
	Иначе
		Элементы.ДоверенныеСертификаты.Видимость = Истина;
		Элементы.ПоказатьИгнорируемыеОшибки.Заголовок = "Скрыть";
	КонецЕсли;
	
	УправлениеДовереннымиСертификатами();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбщуюНастройку(Команда)
	
	Если ЭтаФорма.ТекущийЭлемент <> Неопределено И ЭтаФорма.ТекущийЭлемент.Имя = "ОткрытьОбщуюНастройкуСпособОтправкиМЧД" Тогда
		Настройка = ПолучитьНастройку_("СпособПередачиМЧД");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Настройка, ЭтаФорма);
	ИначеЕсли ЭтаФорма.ТекущийЭлемент <> Неопределено И ЭтаФорма.ТекущийЭлемент.Имя = "ОткрытьОбщуюНастройкуДоставкаМЧДФайлом" Тогда
		Настройка = ПолучитьНастройку_("ДоставкаМЧДФайлом");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Настройка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаОсновныеДанныеМЧД.ТолькоПросмотр = Истина;
	
	Если Объект.Загружена = "1" И Объект.Наша Тогда		
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		Элементы.НадписьПредупреждение.Заголовок = "В МЧД доступен только идентификатор. Отправка файлом не доступна!";
		Элементы.ПолеПросмотра.Видимость = Ложь;		
		Элементы.ОткрытьОбщуюНастройкуСпособОтправкиМЧД.Видимость = Ложь;
		Элементы.ОткрытьОбщуюНастройкуДоставкаМЧДФайлом.Видимость = Ложь;
	ИначеЕсли Объект.Загружена = "1" И Не Объект.Наша Тогда		
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
		Элементы.ПолеПросмотра.Видимость = Ложь;
	ИначеЕсли Объект.Загружена = "2" Тогда		
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
		Элементы.ПолеПросмотра.Видимость = Истина;
	КонецЕсли;
	
	ПроверитьОтправкувАПИ();
		
	Элементы.ГруппаПометкаУдаление.Видимость = Объект.ПометкаУдаления;
	
	Если ЗначениеЗаполнено(Объект.СтатусПроверки) И Не Объект.Наша Тогда
		
		Элементы.ГруппаПроверкаМЧД.Видимость = Истина;
		
		МЧДВалидна = КонтурЛогистика_МашиночитаемыеДовернностиСервер.МЧДВалидна(Объект.СтатусПроверки);
		Если МЧДВалидна Тогда
			
			Элементы.ТекстСтатусаПроверки.Заголовок = СокрЛП(Объект.ТекстСтатусаПроверки) + Формат(Объект.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Истина;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Ложь;
			Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Ложь;
			Элементы.ГруппаПроверкаМЧД.ЦветФона = WebЦвета.СветлоЗеленый;
			Элементы.ОшибкиПроверки.ЦветФона = WebЦвета.СветлоЗеленый;
			
		Иначе
			
			Элементы.ТекстСтатусаПроверки.Заголовок = СокрЛП(Объект.ТекстСтатусаПроверки) + Формат(Объект.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Ложь;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Истина;
			Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Истина;
			Элементы.ГруппаПроверкаМЧД.ЦветФона = WebЦвета.СветлоЗолотистый;
			Элементы.ОшибкиПроверки.ЦветФона = WebЦвета.СветлоЗолотистый;
			
			Если ЗначениеЗаполнено(Объект.ОшибкиПроверки) Тогда
				Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Истина;
				ОшибкиПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПредставлениеОшибокПроверкиМЧД(Объект.ОшибкиПроверки);
			Иначе
				Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаПроверкаМЧД.Видимость = Ложь;
		
	КонецЕсли;

	УправлениеЭлементамиПредставителей();
	
	УправлениеЭлементамиПолномочий();
				
КонецПроцедуры

&НаСервере
Процедура ПроверитьОтправкувАПИ()
	
	Если Не ЗначениеЗаполнено(Объект.ОрганизацияДиадок) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Объект.ОрганизацияДиадок);
	Если ПараметрыСервиса.АвторизацияВыполнена Тогда
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		Элементы.НадписьПредупреждение.Заголовок =
			"У доверителя (кто выдал) задан ключ АПИ Логистики. Отправка доступна только идентификатором. Игнорируются общие настройки:";
		Элементы.ОткрытьОбщуюНастройкуСпособОтправкиМЧД.Видимость = Истина;
		Элементы.ОткрытьОбщуюНастройкуДоставкаМЧДФайлом.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОграничений()
	
	Элементы.Ограничения.Видимость = Ложь;
	Элементы.ПолномочияОграничения.Видимость = Ложь;
	Для каждого Полномочие Из Объект.Полномочия Цикл
		
		Если Полномочие.КоличествоОграничений > 0 тогда
			Элементы.ПолномочияОграничения.Видимость = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДовереннымиСертификатами()
	
	Элементы.СтраницаИгнорируемыеОшибки.Видимость = Объект.ДоверенныеСертификаты.Количество() > 0;
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьПолеПросмотраМЧД()
	
	XMLфайлМЧД = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПолучитьXMLфайлМЧД(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(XMLфайлМЧД) Тогда
	
		XMLфайлМЧД = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПолучитьXMLфайлМЧД(Объект.Ссылка);
		
		РезультатФормирования = Справочники.КонтурЛогистика_МЧД.ТабличныйДокументМЧД(XMLфайлМЧД);
		
		ПолеПросмотра = РезультатФормирования;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайламиПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
			"ЗагрузитьИзФайлаЗавершение", 
			ЭтаФорма, 
			РежимДиалогаВыбораФайла.Открытие, 
			"Выберите архив с доверенностью и подписью", 
			, 
			"Архив (*.zip)");
	
КонецПроцедуры
		
&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(МассивВыбранныхФайлов, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(МассивВыбранныхФайлов) Тогда 
		
		ВыбранныйФайл = МассивВыбранныхФайлов[0];
		
		СписокМЧД = КонтурЛогистика_МашиночитаемыеДоверенностиКлиентСервер.СписокМЧДИзАрхива(ВыбранныйФайл, Объект.Ссылка);
		
		Если СписокМЧД.Количество() = 0 Тогда
			Сообщить("В архиве нет файлов с данной МЧД");
			Возврат;
		КонецЕсли;
		
		КонтурЛогистика_МашиночитаемыеДовернностиСервер.ЗагрузитьМЧДИзАрхива(СписокМЧД[0].Значение.ДвоичныеДанныеДоверенности, СписокМЧД[0].Значение.ДвоичныеДанныеПодписи, Объект.Ссылка);
		
		ЭтаФорма.Прочитать();		
		ПоказатьПолеПросмотраМЧД();		
		УправлениеЭлементамиФормы();
		УстановитьВидимостьОграничений();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПометкаУдаленияЭлементаСправочника" Тогда
		ЭтаФорма.Прочитать();		
		Элементы.ГруппаПометкаУдаление.Видимость = Объект.ПометкаУдаления;
	ИначеЕсли ИмяСобытия = "ОбновитьФормуМЧД" Тогда
		УправлениеЭлементамиФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройку_(ИмяНастройки)
	
	Возврат Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИмяНастройки);
	
КонецФункции

&НаСервере
Функция ВыводитьТаблицуПредставителей()
	
	Для каждого Представитель Из Объект.Представители Цикл
		Если ЗначениеЗаполнено(Представитель.Представление) Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УправлениеЭлементамиПолномочий()
	
	Если Объект.Формат = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ФорматыМЧД.Формат002") Тогда
		
		Элементы.ПолномочияКод.Видимость = Истина;
		Элементы.ПолномочияМнемоника.Видимость = Ложь;
		Элементы.ПолномочияНаименование.Видимость = Истина;
		
	КонецЕсли;
	
	Элементы.ТекстовоеПолномочие.Видимость = ЗначениеЗаполнено(Объект.ТекстовоеПолномочие);
	
	Элементы.Полномочия.Видимость = Объект.Полномочия.Количество() > 0;
	
	Если Объект.Загружена = "1" Тогда
		Элементы.СтраницаВсеДанные.Видимость = Ложь;
	Иначе		
		Элементы.СтраницаВсеДанные.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаПередоверие.Видимость = Объект.ВыданаВПорядкеПередоверия;
	Элементы.ИсходныйДоверитель.Видимость = Объект.ВыданаВПорядкеПередоверия;
	
	Элементы.ВозможностьОформленияПередоверия.Видимость = Не Объект.ВозможностьОформленияПередоверия.Пустая();
	
	ВариантПроверкиПолномочийМЧД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ВариантПроверкиПолномочийМЧД");	
	Элементы.ПроверятьПолномочия.Видимость = ВариантПроверкиПолномочийМЧД <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД.НеПроверять");
			
	Если Объект.Полномочия.Количество() > 0 Тогда
		Элементы.СтраницаПолномочия.Заголовок = "Полномочия (" + Строка(Объект.Полномочия.Количество()) + ")";
	ИначеЕсли ЗначениеЗаполнено(Объект.ТекстовоеПолномочие) Тогда
		Элементы.СтраницаПолномочия.Заголовок = "Полномочия (текст)";
	КонецЕсли;
	
	ПоказыватьПолномочиеВДоверенныхСертификатах = Ложь;
	Для каждого Стр Из Объект.ДоверенныеСертификаты Цикл		
		Если ЗначениеЗаполнено(Стр.Полномочие) Тогда
			ПоказыватьПолномочиеВДоверенныхСертификатах = Истина;
		КонецЕсли;		
	КонецЦикла;
	Элементы.ДоверенныеСертификатыПолномочие.Видимость = ПоказыватьПолномочиеВДоверенныхСертификатах;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиПредставителей()
	
	Элементы.Представители.Заголовок = Элементы.Представители.Заголовок + " (" + Строка(Объект.Представители.Количество()) + ")";
	
	ПоказыватьФЛПредставителиЮЛ = Ложь;
	Для каждого Стр Из Объект.Представители Цикл		
		НайдСтроки = Объект.ФизическиеЛицаПредставителиЮЛ.НайтиСтроки(Новый Структура("ИдентификаторПредставителя", Стр.ИдентификаторПредставителя));
		Если НайдСтроки.Количество() > 0 Тогда
			Стр.ФЛПредставителиЮЛ = "Физ. лица представители (" + Строка(НайдСтроки.Количество()) + ")";
			ПоказыватьФЛПредставителиЮЛ = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	Если ВыводитьТаблицуПредставителей() Тогда
		Элементы.Представители.Видимость = Истина;
		Элементы.ВсеПредставители.Видимость = Ложь;		
	Иначе		
		Элементы.Представители.Видимость = Ложь;
		Элементы.ВсеПредставители.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаФЛПредставителиЮЛ.Видимость = ПоказыватьФЛПредставителиЮЛ;
	Элементы.ПредставителиФЛПредставителиЮЛ.Видимость = ПоказыватьФЛПредставителиЮЛ;
			
КонецПроцедуры

#КонецОбласти
